## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 22 to add, 0 to change, 9 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                  |
|----------|--------------------------------------------------------------------------------------------------------|
| add      | `aws_acm_certificate_validation.notification-canada-ca`                                                |
|          | `aws_acm_certificate_validation.notification-canada-ca-alt`                                            |
|          | `aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs`                                 |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.notification.alpha.canada.ca&quot;]`                  |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.notification.alpha.canada.ca&quot;]`             |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.notification.alpha.canada.ca&quot;]`                      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.notification.alpha.canada.ca&quot;]`                    |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;notification.alpha.canada.ca&quot;]`                        |
|          | `aws_route53_record.notification-canada-ca[&quot;*.api.notification.canada.ca&quot;]`                            |
|          | `aws_route53_record.notification-canada-ca[&quot;*.document.notification.canada.ca&quot;]`                       |
|          | `aws_route53_record.notification-canada-ca[&quot;*.notification.canada.ca&quot;]`                                |
|          | `aws_route53_record.notification-canada-ca[&quot;api.notification.canada.ca&quot;]`                              |
|          | `aws_route53_record.notification-canada-ca[&quot;notification.canada.ca&quot;]`                                  |
|          | `module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|          | `module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|          | `module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|          | `module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|          | `module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]` |
| delete   | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                         |
|          | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                   |
|          | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                     |
|          | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                   |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                     |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]`    |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]`    |
| recreate | `aws_cloudwatch_log_subscription_filter.admin_api_request[0]`                                          |
|          | `aws_cloudwatch_log_subscription_filter.blazer_logging[0]`                                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate_validation.notification-canada-ca will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:296255494825:certificate/064def8b-e629-4de0-8eb7-3a9589181c02"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:296255494825:certificate/73a921c0-11da-4351-9584-3850e012787b"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-application-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.admin_api_request[0] must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.admin_api_request)
-/+ resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2337749455" -> (known after apply)
        name            = "Admin API request"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.blazer_logging[0] must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.blazer_logging)
-/+ resource "aws_cloudwatch_log_subscription_filter" "blazer_logging" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> (known after apply) # forces replacement
      ~ id              = "cwlsf-1214848348" -> (known after apply)
        name            = "Blazer logging"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["*.api.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
      + records         = [
          + "_ac309158c158035bfb929da1617e2b16.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.document.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_db43d1cf891afd4671fb913d18ef0a0e.document.notification.canada.ca"
      + records         = [
          + "_130ea19fa1fdd9e59b7632fbac0d7e00.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
      + records         = [
          + "_aaacd89cd470de0970c70c7ab1b7d4d5.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["api.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
      + records         = [
          + "_ac309158c158035bfb929da1617e2b16.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
      + records         = [
          + "_aaacd89cd470de0970c70c7ab1b7d4d5.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_35e023fab08debc90c4312ec398d5458.document.notification.alpha.canada.ca"
      + records         = [
          + "_851a551fec0bff7d31f336583a3138e7.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_c04744a360b120e8b7431728784deab4.notification.alpha.canada.ca"
      + records         = [
          + "_70060f7d839ca6659556126a3224d85b.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["api.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_c04744a360b120e8b7431728784deab4.notification.alpha.canada.ca"
      + records         = [
          + "_70060f7d839ca6659556126a3224d85b.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - id                = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - name              = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - tags_all          = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      - arn       = "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - id        = "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - name      = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/sentinel-cloud-watch-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAUJ6RUDKU7X5HOF5ZQ" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_iam_role" "sentinel_forwarder_lambda" {
      - arn                   = "arn:aws:iam::296255494825:role/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-23T13:13:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-05-18T13:19:54Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUJ6RUDKUV4HLRDMEW" -> null

      - inline_policy {}
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      - id         = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder-20230123131344283100000001" -> null
      - policy_arn = "arn:aws:iam::296255494825:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_function" "sentinel_forwarder" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to forward AWS logs to Azure Sentinel" -> null
      - filename                       = "/tmp/sentinel_forwarder.py.zip" -> null
      - function_name                  = "sentinel-cloud-watch-forwarder" -> null
      - handler                        = "sentinel_forwarder.lambda_handler" -> null
      - id                             = "sentinel-cloud-watch-forwarder" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2023-01-23T14:37:18.794+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:37",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::296255494825:role/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - runtime                        = "python3.9" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> null
      - source_code_size               = 300 -> null
      - tags                           = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "notification-canada-ca-production"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CUSTOMER_ID" = (sensitive)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "Active" -> null
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/containerinsights/notification-canada-ca-production-eks-cluster/application:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> null
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:296255494825:log-group:blazer:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> null
    }

  # module.sentinel_forwarder[0].data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-cloud-watch-forwarder"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
        }
    }

  # module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
    }

  # module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloud-watch-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:37",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/containerinsights/notification-canada-ca-production-eks-cluster/application:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:296255494825:log-group:blazer:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1"
      + statement_id_prefix = (known after apply)
    }

Plan: 22 to add, 0 to change, 9 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
